#+STARTUP: hideblocks

* wget

Download files from the Web.
Supports HTTP, HTTPS, and FTP.

** Downlaod file and write its contents to STDOUT

#+BEGIN_SRC sh
wget -O- xuchunyang.me
#+END_SRC

#+RESULTS:
: Under construction...

** Download 404 page

#+BEGIN_SRC sh :results output silent
wget --content-on-error -qO- xuchunyang.me/file/not/found || [[ $? == 8 ]]
#+END_SRC

** Exectue shell script at URL through pipe

#+BEGIN_SRC sh :results output
wget -O- https://xuchunyang.me/hello.sh | sh
#+END_SRC

#+RESULTS:
: Hello World

** Pretend to curl

#+BEGIN_SRC sh
wget -q -O- -U curl/7.55.1 ip.cn
#+END_SRC

#+RESULTS:
: 当前 IP：221.231.52.191 来自：江苏省盐城市 电信

** Use HTTP Proxy

#+BEGIN_SRC sh
http_proxy=http://127.0.0.1:1087 wget -q -O- -U curl/7.55.1 ip.cn
#+END_SRC

#+RESULTS:
: 当前 IP：27.0.232.148 来自：香港特别行政区 OneProvider

** Resume an interrupted download previously started by wget itself

#+BEGIN_SRC sh
wget -c https://mirrors.tuna.tsinghua.edu.cn/gnu/emacs/emacs-25.2.tar.gz
#+END_SRC

* curl

Transfers data from or to a server.
Supports most protocols, including HTTP, FTP, and POP3.

** Follow redirection

#+BEGIN_SRC sh
curl -L xuchunyang.me
#+END_SRC

#+RESULTS:
: Under construction...

** Print header only

#+BEGIN_SRC sh :results output
curl -I xuchunyang.me
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
HTTP/1.1 301 Moved Permanently
Cache-Control: public, max-age=0, must-revalidate
Content-Length: 38
Content-Type: text/plain
Date: Mon, 28 Aug 2017 11:31:00 GMT
Location: https://xuchunyang.me/
Age: 160
Connection: keep-alive
Server: Netlify

#+END_EXAMPLE

** HTTP proxy

#+BEGIN_SRC sh
# no proxy
curl ip.cn
# use environment variable
http_proxy=http://127.0.0.1:1087 curl ip.cn
# or use cli option -x/--proxy
curl -x http://127.0.0.1:1087 ip.cn
#+END_SRC

#+RESULTS:
| 当前 | IP：221.231.52.191 | 来自：江苏省盐城市   | 电信        |
| 当前 | IP：27.0.232.148   | 来自：香港特别行政区 | OneProvider |
| 当前 | IP：27.0.232.148   | 来自：香港特别行政区 | OneProvider |

** Socks proxy

#+BEGIN_SRC sh
curl -x socks5://127.0.0.1:1086 ip.cn
#+END_SRC

#+RESULTS:
: 当前 IP：27.0.232.148 来自：香港特别行政区 OneProvider

** Exectue shell script at URL through pipe

#+BEGIN_SRC sh
curl -sSf https://xuchunyang.me/hello.sh | sh
#+END_SRC

#+RESULTS:
: Hello World

* diff

Compare files and directories.

** Diff the output of two commands via =(info "(bash) Process Substitution")=

#+BEGIN_SRC bash :results output
diff -u <(echo foo bar) <(echo foo baz) || [[ $? == 1 ]]
#+END_SRC

#+RESULTS:
: --- /dev/fd/63	2017-08-28 20:01:05.250831000 +0800
: +++ /dev/fd/62	2017-08-28 20:01:05.251107000 +0800
: @@ -1 +1 @@
: -foo bar
: +foo baz

** Diff the output of a command with some text

#+BEGIN_SRC bash :results output
diff -u <(pwd) - <<< $HOME || [[ $? == 1 ]]
#+END_SRC

#+RESULTS:
: --- /dev/fd/63	2017-08-28 20:06:56.728148000 +0800
: +++ -	2017-08-28 20:06:56.733910000 +0800
: @@ -1 +1 @@
: -/Users/xcy/.emacs.d
: +/Users/xcy

* cat

concatenate files and print on the standard output

** Here document:

#+BEGIN_SRC sh :results output
cat << EOF
\$ Working dir "$PWD" `pwd`
EOF
#+END_SRC

#+RESULTS:
: $ Working dir "/Users/xcy/.emacs.d" /Users/xcy/.emacs.d

** Here strings (Bash/Zsh only)

#+BEGIN_SRC sh
cat <<< $HOME
cat <<< `pwd`
#+END_SRC

#+RESULTS:
| /Users/xcy          |
| /Users/xcy/.emacs.d |

* tee

Read from standard input and write to standard output and files.

** Copy standard input to each FILE, and also to standard output

#+BEGIN_SRC sh :results output
curl -L xuchunyang.me/hello.sh | tee hello.sh
#+END_SRC

#+RESULTS:
: #!/bin/sh
: 
: echo Hello World

* dd

Convert and copy a file.

** Create Arch Linux Installer USB drive on macOS

#+BEGIN_SRC sh :results silent output
diskutil list
diskutil unmountDisk /dev/disk2
# Note this dd is from GNU Coreutils, not the preinstalld one
sudo dd bs=4M if=~/Downloads/archlinux-2017.08.01-x86_64.iso of=/dev/rdisk2 status=progress && sync
#+END_SRC

* pacman

** Install

#+BEGIN_SRC sh
pacman -S zsh
#+END_SRC

** Uninstall

#+BEGIN_SRC sh
pacman -Rs vim
#+END_SRC

** Upgrade

#+BEGIN_SRC sh
pacman -Syu
#+END_SRC

** Search

#+BEGIN_SRC sh
# Search package name & description
pacman -Ss vim
# Search package name
pacman -Sqs | grep vim$
#+END_SRC

** Cheak if a package is installed

#+BEGIN_SRC sh
pacman -Si zsh
pacman -Qi zsh
pacman -Qs zsh
#+END_SRC

** List files provided by a package

#+BEGIN_SRC sh
pacman -Qql zsh
#+END_SRC

** Check a file is provided by which package

#+BEGIN_SRC sh
pacman -Qo /bin/awk
#+END_SRC
